AcDbViewTableRecord.setPreviewImage(Atil.Image!System.Runtime.CompilerServices.IsConst*)
This functions sets Atil::Image thumbnail into view
pPreviewImage:  A pointer of Atil::Image thumbnail to be set into view
Returns:  This will return Acad::eOk if thumbnail is successfully set. It returns error status otherwise
Remarks:  Internal use only

AcDbViewTableRecord.getPreviewImage(Atil.Image**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function provides Atil::Image thumbnail of view as output
pPreviewImage:  A reference to the pointer of Atil::Image thumbnail
Returns:  This will return Acad::eOk if thumbnail is successfully retrieved. It returns error status otherwise
Remarks:  Internal use only

AcDbViewTableRecord.setThumbnail(tagBITMAPINFO!System.Runtime.CompilerServices.IsConst*)
This function sets BITMAP thumbnail into view
thumbnail:  A pointer of Bitmap thumbnail to be set into view
Returns:  This will return Acad::eOk if thumbnail is successfully set. It returns error status otherwise

AcDbViewTableRecord.getThumbnail(tagBITMAPINFO**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function provides BITMAP thumbnail of view as output
thumbnail:  A reference to a pointer of Bitmap thumbnail, containing header and pixels
Returns:  This will return Acad::eOk if thumbnail is successfully retrieved. It returns error status otherwise